---
kind: enumMember
id: F:Autodesk.Revit.DB.ElementOnPhaseStatus.Temporary
enum: Autodesk.Revit.DB.ElementOnPhaseStatus
source: html/bfc481cc-11c8-de0b-1d71-7b2ffa711780.htm
---
# Autodesk.Revit.DB.ElementOnPhaseStatus.Temporary

Created and demolished during this phase